#include <iostream>

using namespace std;

/* Вариант 1
1. 	Дана последовательность натуральных чисел {aj}j=1...n (n<=10000). Если в последовательности 
есть хотя бы одно число, начинающееся цифрой 1, упорядочить последовательность по неубыванию.
2. 	Ввести последовательность натуральных чисел {Aj}j=1...n (n<=1000). Упорядочить последовательность по 
неубыванию первой цифры числа, числа с одинаковыми первыми цифрами дополнительно упорядочить по неубыванию 
суммы цифр числа, числа с одинаковыми первыми цифрами и одинаковыми суммами цифр 
дополнительно упорядочить по неубыванию самого числа. 
3. 	Дана целочисленная матрица {Aij}i=1..n,j=1..m (n,m<=100). Найти строку, сумма элементов 
которой наиболее близка к 0, и заменить все элементы этой строки числом 0.
4.  Сначала введите последовательность. Затем удалите и продублируйте элементы. Затем выведите 
полученную последовательность (каждый элемент по одному разу). Используйте в программе только 
один массив.
5.  Дана последовательность натуральных чисел {Aj}j=1...n (n<=10000). Удалить из последовательности 
числа, содержащие цифру 7, но не содержащие цифру 6, а среди оставшихся продублировать простые 
числа.*/

int main() {

    cout << "Hi";

    return 0;
}